# Dataquest Guided Project

Certificate: SQL Fundamentals

## Analysis of the CIA World Factbook

https://www.cia.gov/library/publications/the-world-factbook/

This database contains information on all of the countries on Earth, from 2015

#### Connecting to database

In [ ]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

## Viewing Table

In [4]:
%%sql
SELECT *
    FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [5]:
%%sql
SELECT *
    FROM facts
    LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

#### Viewing Minima and Maxima

In [7]:
%%sql
SELECT MIN(population),
       MAX(population),
       MIN(population_growth),
       MAX(population_growth)
    FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

#### Country With Lowest Population

In [11]:
%%sql
SELECT name, 
       population
    FROM facts
    WHERE population = (SELECT MIN(population)
                           FROM facts);

Done.

[('Antarctica', 0)]

#### Country With Highest Population

In [10]:
%%sql
SELECT name, 
       population
    FROM facts
    WHERE population = (SELECT MAX(population)
                           FROM facts);

Done.

[('World', 7256490011)]

#### Minima and Maxima Excluding World

In [12]:
%%sql
SELECT MIN(population),
       MAX(population),
       MIN(population_growth),
       MAX(population_growth)
    FROM facts
    WHERE name != 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

### Average Values

In [14]:
%%sql
SELECT AVG(population),
       AVG(area)
    FROM facts
    WHERE name != 'World';

Done.

[(32242666.56846473, 555093.546184739)]

### Densely Populated Countries

In [21]:
%%sql
SELECT name,
       population,
       area,
       population / area AS density
    FROM facts
    where population > (SELECT AVG(population)
                           FROM facts)
          AND area < (SELECT AVG(area)
                         FROM facts);

Done.

[('Bangladesh', 168957745, 148460, 1138),
 ('Germany', 80854408, 357022, 226),
 ('Japan', 126919659, 377915, 335),
 ('Philippines', 100998376, 300000, 336),
 ('Thailand', 67976405, 513120, 132),
 ('United Kingdom', 64088222, 243610, 263),
 ('Vietnam', 94348835, 331210, 284)]

In [24]:
%%sql
SELECT name,
        population / area AS density
    FROM facts
    WHERE density > (SELECT AVG(CAST(population AS FLOAT) / area)
                     FROM facts)
    ORDER BY density DESC
    LIMIT 12;

Done.

[('Macau', 21168),
 ('Monaco', 15267),
 ('Singapore', 8141),
 ('Hong Kong', 6445),
 ('Gaza Strip', 5191),
 ('Gibraltar', 4876),
 ('Bahrain', 1771),
 ('Maldives', 1319),
 ('Malta', 1310),
 ('Bermuda', 1299),
 ('Sint Maarten', 1167),
 ('Bangladesh', 1138)]

Just because a country has above average population and below average area, it doesn't mean it will be one of the most densely populated. 
Bangladesh, the most dense of the first list, is only number 12 in the world